family = ["Maka", "Nika", "Andria", "ilia", "elza", "dato", "nana", "merabi", "mari", "elene", "anano"]
print("გამარჯობა მე ვარ " + family[2] + ". დედაჩემს ქვია " + family[0] + 
      ". მამაჩემს ქვია " + family[1] + ". ჩემი ძმაა " + family[3] +
      ". დედის მხრიდან ბებოს ქვია " + family[4] + ".  მამის მხრიდან ბებოს ქვია " + family[6] +
      ". დედაჩემის მხრიდან პაპას ქვია " + family[5] + ". მამაჩემის მხრიდან პაპაჩემს ქვია " + family[7] +
      ". ჩემ პირველ დეიდაშვილს ქვია " + family[8] + ".  მეორე დეიდაშვილს ქვია " + family[9] + 
      "  და მესამე დეიდაშვილს ქვია " + family[10] + ".") 