#question 1
#რა არის პითონი პროგრამირებაში? -- ერთ-ერთი ენა პროგრამირებაში

#question 2
#რა არის Turtle-ი Python-ში? -- library

#question 3
#რას გამოიტანს ეს კოდი ტერმინალში?
print('heloo World')
#ამ კითხვის პასუხია "heloo World"

#question 4
#რას გამოიტანს ეს კოდი ტერმინალში?
print(True>False)
#True = 1 False = 0 ამიტომ True > False

#question 5
#რას გამოიტანს ეს კოდი ტერმინალში?
x = 15
y = 4
print(x // y)
# "//" არის გაყოფა რომელიც გვიჩვენებს რამდენჯერ თავსდება
#15 : 4 = 3,75
#რადგან მხოლოდ მთელ რიცხვებს გვიჩვენებს 15-ში 4 მოთავსდა 3-ჯერ

#quetion 6
#რას გამოიტანს ეს კოდი ტერმინალში?
x = 10
y = "20"
print(x + y)
#ეს კოდი გამოიტანს error-ს რადგან ინტეჯერს არ დაემატება სტრინგი

#question 7
#რას გამოიტანს ეს კოდი ტერმინალში?
x = 5
y = 2
print(x ** y)
#ორი ** ნიშნავს ახარისხებას აქედან 
#გამომდინარე 5**2 იქნება 25

#question 8
#if მუშაობს else-ის გარეშე
#პასუხია True რადგან if იმუშავებს 
#else-ის გარეშე

age = 18
if age ==18:
    print("good")
# else:
#     print("you are an adult now")

#question 9
#რითი მთავრდება for loop?
#პასუხი არის brake 

#question 10
#რა იქნება თუ 10 % 3?
#პასუხი არის 1 რადგან 10 რომ 
#გავყოთ სამზე არის სამი და ნაშთია 1

#question 11
#integer-ი მრავლდება string-ზე 
#სწორი პასუხია True 
# მაგ:
print("Andria " * 5)

#question 12
#რას გამოიტანს ეს კოდი ტერმინალში?
print(3>4 or 3<5 and 500<400 or 320>244)
#print(false or true and false or true)
#აქ პასუხი არის True

#question 13
#რა არის სია list?
#სწორი პასუხია array--იგივე მასივი ამიტომ
#სია არის მასივი რადგან ის ინახავს ყველანაირ ტიპს

#question 14
#რა არის ალგორითმი?
#ალგორითმი არის მოქმედების, ნაბიჯ-ნაბიჯ
#შესრულება :))


#question 15
#პითონი გველია თუ კუდი?
#პითონი ყოფილა კუდი

#question 16
#დავით უსმენს როკის სტილის მუსიკას?
#True

#question 17
#ბატონი გაბრიელი არ უსმენს მამა პაპურულ ქართულ მუსიკებს
#False ბატონი გაბრიელი უსმენს მამა პაპურულ მუსიკებს

#question 18 
#გაკვეთილი ჩატარდა კანფეტივით
#TRUE

#question 19
#რომელი ხინკალი ჯობია?
#საქართველოში საუკეთესო ხინკალია ფასანაურული
#ამიტომ ფასანაურული ჯობია ყველას